app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "avatar_file_name", "avatar_file_size", "pic1_content_type", "updated_at", "pic1_file_name", "pic1_file_size", "avatar_content_type", "pic1_updated_at", "avatar_updated_at") VALUES('twyuu', '2009-08-24 02:48:47', 'shinkansen.jpg', 197145, 'image/jpeg', '2009-08-24 02:48:47', 'lan5.jpg', 63598, 'image/jpeg', '2009-08-24 02:48:46', '2009-08-24 02:48:46')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2009-08-24 02:43:46', "avatar_file_size" = 63598, "name" = 'afwefafe', "avatar_file_name" = 'lan5.jpg', "avatar_updated_at" = '2009-08-24 02:43:45' WHERE "id" = 2